{
    "test": "Config Obj loaded.",
    "hosting_type": "html",
    "whatsapp_num": 584129880890,
    "proyectos": [
        {
            "id": 1,
            "mostrar": true,
            "demo": false,
            "nombre": "Sistema CRM",
            "url": "../projects/crm_bosto/index.html",
            "thumb": "../projects/crm_bosto/thumbnail.jpg",
            "capturas": 11,
            "descripcion": "<p>Sistema CRM multiusuario diseñado y desarrollado para optimizar y centralizar la gestión administrativa de la empresa, brindando herramientas clave para mantener un control eficiente en cada operación combinando un diseño moderno con un desempeño sólido y confiable.</p><p class='resaltar'>Características Principales</p><ul><li><b>Módulo de Bancos y Conciliación:</b> Para gestionar cuentas bancarias y realizar conciliaciones rápidas y precisas.</li><li><b>Reportes de Pagos:</b> Permite a los usuarios reportar pagos de sus clientes asignados de forma rapida y precisa mediante un formulario interactivo.</li><li><b>Pedidos:</b> Permite a los usuarios registrar pedidos de manera rapida y eficiente.</li><li><b>Generación de Notas de Crédito:</b> Para automatizar la creación de notas de crédito, facilitando la gestión de transacciones.</li><li><b>Gestión de Usuarios:</b> Permite administrar perfiles, roles y permisos de forma segura y personalizada.</li><li><b>Reportería Completa:</b> Emite reportes avanzados para bancos y cobranzas, mejorando la toma de decisiones con datos precisos.</li></ul><br><p class='resaltar'>Tecnología y Arquitectura</p><ul><li><b>Bases de Datos:</b> Utiliza SQL Server para una gestión robusta y escalable de la información.</li><li><b>Auto-Hosteado:</b> Implementado en la red LAN, garantizando privacidad y control total de los datos.</li><li><b>Acceso Remoto:</b> Configuración de acceso remoto mediante servicios de DNS, permitiendo la disponibilidad desde cualquier lugar.</li></ul><br><p class='resaltar'>Ventajas Competitivas:</p><ul><li><b>Eficiencia Operativa:</b> Centraliza procesos clave y ahorra tiempo valioso en tareas administrativas de la empresa.</li><li><b>Flexibilidad y Escalabilidad:</b> Diseñado y documentado de forma que permite agregar modulos de una manera facil y rapida.</li><li><b>Acceso Seguro:</b> Ofrece un entorno de trabajo protegido y accesible para todos los usuarios autorizados.</li></ul><br><p>Este sistema no solo se conviertio en una herramienta esencial para la gestión integral en la empresa, sino que también reforzo la productividad y fortalecio la organización interna, asegurando una operación eficiente y sin contratiempos.</p>",
            "estatus": "En producción",
            "tipo_proyecto": "Laboral",
            "tecnologias": [
                "HTML",
                "CSS",
                "Bootstrap",
                "JavaScript",
                "Datatables",
                "JSON",
                "PHP",
                "SQL"
            ]
        },
        {
            "id": 2,
            "mostrar": true,
            "demo": false,
            "nombre": "Portal de pagos (API BNC)",
            "url": "../projects/sistema_vpos/index.html",
            "thumb": "../projects/sistema_vpos/thumbnail.jpg",
            "capturas": 6,
            "descripcion": "<p>El Portal de Pagos Lior fue pensado como una solución estratégica para transformar y simplificar el proceso de pago de los clientes, combinando tecnología avanzada con una experiencia intuitiva y fluida. Este sistema ofrece varias modalidades de pago que se adaptan a las necesidades actuales de los clientes, incluyendo:</p><ul><li><b>C2P (Consumer to Payment):</b> Pagos directos con una experiencia optimizada para los usuarios.</li><li><b>VPOS (Virtual Point of Sale):</b> Una alternativa digital práctica y segura.</li><li><b>Transferencias y P2P:</b> Permite a los clientes reportar pagos desde otros bancos, integrando todas las transacciones en un único sistema.</li></ul><br><p class='resaltar'>Características Sobresalientes</p><ul><li><b>Historial de Transacciones:</b> Los usuarios pueden consultar y gestionar un registro completo de sus operaciones, garantizando transparencia y control.</li><li><b>Extracción de movimientos:</b> El sistema permite tanto a clientes como usuarios administrativos exportar el historial de transacciones realizadas en formato XLS o CSV.</li><li><b>Validación en Tiempo Real:</b> Cada pago es verificado inmediatamente, minimizando errores y mejorando la eficacia del sistema.</li><li><b>Sistema Integrado:</b> Centraliza todas las modalidades de pago y los reportes, asegurando una gestión simple y organizada.</li></ul><br><p class='resaltar'>Colaboración Estratégica</p><p>El desarrollo del portal contó con la asesoría técnica del personal especializado del Banco BNC, quienes facilitaron el acceso y la implementación de su API, asegurando una integración robusta y segura. Una vez finalizado el desarrollo del sistema este fue validado y certificado por escrito por la gente del banco BNC.</p><p>El portal no solo modernizo el proceso de pagos en la empresa, sino que también reforzo la confianza y comodidad de los clientes al ofrecer una plataforma confiable, adaptable y de alto rendimiento. Con esta herramienta, la empresa dio un gran paso hacia la digitalización y la eficiencia operativa, manteniéndose a la vanguardia y un paso adelante ante sus competidores.</p>",
            "estatus": "En producción",
            "tipo_proyecto": "Laboral",
            "tecnologias": [
                "HTML",
                "CSS",
                "Bootstrap",
                "JavaScript",
                "Datatables",
                "BNC-API",
                "JSON",
                "PHP",
                "MySQL"
            ]
        },
        {
            "id": 3,
            "mostrar": true,
            "demo": true,
            "nombre": "Sistema de reservas",
            "url": "http://arnica.dnsalias.com:8000/dataentry",
            "thumb": "../projects/sistema_arnica/thumbnail.jpg",
            "capturas": 12,
            "descripcion": "<p>Sistema de reservas para atletas Desarrollado con Node.js, Vanilla JavaScript, Bootstrap y MySQL, este innovador sistema permite a los atletas realizar reservas para sesiones de masajes en eventos deportivos de manera rápida y sencilla. Diseñado específicamente para el stand de la marca Rhelen Árnica, la plataforma combina funcionalidad, eficiencia y una experiencia de usuario impecable.</p><p>El sistema ofrece una interfaz guiada que se presenta como un asistente dividido en cuatro pantallas, facilitando el proceso de registro. Este asistente interactivo valida minuciosamente los datos del usuario, las fechas de reserva, horarios disponibles, estaciones asignadas y la vinculación con eventos específicos, asegurando que cada atleta disfrute de un proceso fluido y personalizado.</p><p class='resaltar'>Sistema de gestion</p><p>Cuenta con un robusto CMS que permite a los administradores gestionar todos los aspectos del sistema, incluyendo:</p><ul><li><b>Eventos deportivos:</b>Agrega, edita y organiza eventos relevantes.</li><li><b>Estaciones de masajes:</b>Configura áreas de atención específicas.</li><li><b>Horarios y descansos:</b>Optimiza la agenda de los masajistas y establece pausas según la carga de trabajo. </li><li><b>Registros de usuarios:</b>Controla y analiza las reservas realizadas por los atletas.</li></ul><br><p>Este sistema no solo mejora la logística y administración en el stand, sino que también garantiza una experiencia superior para los participantes, fortaleciendo la imagen de la marca en el ámbito deportivo.</p>",
            "estatus": "En producción",
            "tipo_proyecto": "Laboral",
            "tecnologias": [
                "HTML",
                "CSS",
                "Bootstrap",
                "JavaScript",
                "Datatables",
                "Node",
                "PM2",
                "MySQL"
            ]
        },
        {
            "id": 4,
            "mostrar": true,
            "demo": false,
            "nombre": "Portal de pedidos (Profit)",
            "url": "../projects/portal_pedidos_intervit/index.html",
            "thumb": "../projects/portal_pedidos_intervit/thumbnail.jpg",
            "capturas": 2,
            "descripcion": "<p>Aplicación de Toma y Carga de Pedidos Diseñada especialmente para los vendedores de <strong>Intervit, C.A.</strong>, esta aplicación revoluciona la gestión de pedidos al integrarse con el sistema <strong>Profit</strong>, asegurando una experiencia eficiente, precisa y accesible desde cualquier dispositivo.</p><p class='resaltar'>Características Destacadas</h2><ul><li>Emulación y mejora del sistema original, con acceso completo a la lista de clientes y productos. </li><li>Precisión en cálculos hasta <strong>5 decimales</strong>.</li><li>Soporte para trabajo <strong>multimoneda</strong>, adaptándose a operaciones internacionales. </li><li>Carga masiva de artículos a partir de un archivo de texto.</li><li>Historial de pedidos en cola editable hasta el momento del procesamiento.</li><li>Sistema de inicio de sesión con <strong>tokens de seguridad</strong>, personalizando opciones según el usuario.</li></ul><br><p class='resaltar'>Ventajas Clave</h2><p>La toma de pedidos no afecta el <strong>stock</strong>hasta su procesamiento, optimizando los flujos de inventario. Además, la aplicación está completamente adaptada para su uso en equipos de escritorio y dispositivos móviles, garantizando una experiencia flexible y accesible para los vendedores.</p>",
            "estatus": "En producción",
            "tipo_proyecto": "Laboral",
            "tecnologias": [
                "HTML",
                "CSS",
                "Bootstrap",
                "JavaScript",
                "Datatables",
                "JSON",
                "PHP",
                "MySQL",
                "SQL"
            ]
        },
        {
            "id": 5,
            "mostrar": true,
            "demo": true,
            "nombre": "Sistema de tickets",
            "url": "http://enlacesbosto.dnsalias.com:8083/railerch/ticsys/index.php",
            "thumb": "../projects/sistema_tickets/thumbnail.jpg",
            "capturas": 8,
            "descripcion": "<p>Este sistema fue diseñado para mejorar la gestión de solicitudes técnicas en ADMINISTRADORA 1718, C.A. empresa encargada de la administracion general de tiendas Seven's, facilitando las labores de soporte técnico de manera eficiente y organizada al eliminar el uso de canales informales como WhatsApp o la comunicación oral, proporcionando una herramienta de trabajo profesional y confiable.</p><p>Con su diseño <strong>multiusuario</strong>, este sistema se adapta perfectamente a las necesidades empresariales modernas, optimizando los procesos de resolución de problemas y asegurando la mejor experiencia tanto para los usuarios como para los equipos técnicos.</p><p class='resaltar'>Funciones Principales</p><ul><li><strong>Gestión de tickets:</strong> Clasificación en abiertos, en espera y cerrados.</li><li><strong>Asignación de tareas:</strong> Modulo de asignación de tareas para analistas técnicos con sistema de puntos para la gestion de meritos.</li><li><strong>Historial:</strong> Registro detallado de solicitudes para seguimiento y control.</li><li><strong>Gestión de usuarios:</strong> Registro y control de usuarios para el acceso al panel administrativo o creación de tickets.</li><li><strong>Gestión de sedes:</strong> Creación de sedes y despartamentos asociados a la empresa.</li><li><strong>Gestion de respaldos de BD:</strong> Respaldo, listado y descarga de la base de datos de trabajo desde el panel administrativo.</li><li><strong>Chat integrado:</strong> Comunicación directa y rápida entre usuarios.</li><li><strong>Registro de actividad:</strong> Registro completo de acciones y eventos del sistema.</li><li><strong>Modulo de reportes:</strong> Emisión de reportes de tickets y tareas por técnico, tickets generados por sedes y reporte global.</li><li><strong>Dashboard interactivo:</strong> Gráficas para conteo de tickets e indicadores mensuales.</li></ul><br><p class='resaltar'>Ventajas del Sistema:</p><ul><li>Este sistema no solo simplifica el soporte técnico, sino que también mejora la transparencia y la organización dentro de la empresa.</li><li>Con herramientas de reportería y análisis gráfico, ofrece a los administradores una visión clara del desempeño y las áreas que requieren mejoras.</li><li>Diseñado para ser una solución integral, garantiza una experiencia eficiente y profesional para todos los usuarios.</li></ul><br> <p><span class='resaltar'>Datos de prueba:</span> Usuario: root | Clave: r007_[dia del mes] ejemplo: r007_01</p>",
            "estatus": "En producción",
            "tipo_proyecto": "Laboral",
            "tecnologias": [
                "HTML",
                "CSS",
                "Bootstrap",
                "JavaScript",
                "jQuery",
                "Datatabless",
                "Ajax",
                "PHP",
                "MySQL"
            ]
        },
        {
            "id": 6,
            "mostrar": true,
            "demo": true,
            "nombre": "Sistema Cloud Storage",
            "url": "http://enlacesbosto.dnsalias.com:8083/railerch/clouddrive/login.php",
            "thumb": "../projects/drive_app/thumbnail.jpg",
            "capturas": 5,
            "descripcion": "<p>Este sistema fue diseñado para satisfacer necesidad de una herramienta estable y confiable que permitiera la gestión remota y centralizada de archivos dentro de una empresa. Su funcionalidad se inspira en plataformas como Google Drive y Dropbox pero con un enfoque personalizado y adaptado a las necesidades específicas corporativas, eliminando la dependencia de una conexión RDP de Windows.</p><p>Ofrece una solución robusta, fácil de usar y perfectamente integrada para optimizar el manejo de archivos y directorios, mejorando la eficiencia y asegurando el acceso desde cualquier lugar.</p><p class='resaltar'>Funciones Destacadas</p><ul><li><strong>Gestión de cuentas:</strong> Los usuarios pueden registrarse, gestionar y eliminar sus cuentas según sus necesidades.</li><li><strong>Directorios y archivos:</strong> Creación y eliminación de directorios, subdirectorios y archivos de texto plano.</li><li><strong>Soporte para múltiples formatos:</strong> Carga y descarga de archivos en formatos como JPG, PNG, XLSX, DOCX, PPTX, PDF, entre otros.</li><li><strong>Acceso remoto:</strong> Gestión centralizada accesible sin depender de conexiones específicas. </li><li><strong>Interfaz intuitiva:</strong> Diseñado para proporcionar una experiencia de usuario fluida y adaptada. </li></ul><br><p class='resaltar'>Ventajas Clave</p><ul><li>Permite una gestión eficiente de archivos corporativos.</li><li>Su diseño multiusuario garantiza que todos los empleados puedan acceder a la herramienta sin limitaciones</li><li>Al estar centralizada en un servidor web dedicado elimina la dependencia de conexiones específicas como Windows RDP desde un computador de escritorio, esto facilita el acceso a la información desde cualquier dispositivo en el momento que se necesite.</li></ul><br> <p><span class='resaltar'>Datos de prueba:</span> Usuario: root, Clave: r007</p>",
            "estatus": "En produccion",
            "tipo_proyecto": "Laboral",
            "tecnologias": [
                "HTML",
                "CSS",
                "Bootstrap",
                "JavaScript",
                "PHP"
            ]
        },
        {
            "id": 7,
            "mostrar": true,
            "demo": true,
            "nombre": "Web Lior Cosmetics, C.A.",
            "url": "https://liorcosmetics.com/",
            "thumb": "../projects/liorcosmetics_web/thumbnail.jpg",
            "capturas": 3,
            "descripcion": "<p>Este portal web fue desarrollado con el objetivo de potenciar la presencia en línea de <strong>Lior Cosmetics, C.A.</strong>, permitiendo mostrar sus productos y servicios de manera atractiva y accesible para sus clientes.</p><p>Con un diseño moderno y funcional, el portal proporciona una plataforma integral para que los usuarios puedan explorar la oferta de la empresa, interactuar con su contenido y gestionar sus pagos de forma sencilla y segura.</p><p class='resaltar'>Funciones Principales</p><ul><li><strong>Gestión de publicaciones:</strong> CMS integrado para administrar fácilmente las publicaciones del blog.</li><li><strong>Módulo de pagos:</strong> Funcionalidad que permite a los clientes reportar pagos a través de la <strong>API del BNC</strong>. </li><li><strong>Validación en tiempo real:</strong> Garantiza la verificación rápida y eficiente de los pagos realizados.</li><li><strong>Interfaz intuitiva:</strong> Proporciona una experiencia fluida y amigable para los usuarios. </li></ul><p class='resaltar'>Beneficios</p><p>Este portal web no solo facilita la interacción entre la empresa y sus clientes, sino que también mejora la gestión interna de los procesos relacionados con pagos y contenido. Con herramientas avanzadas para la administración de publicaciones y la validación de transacciones, <strong>Lior Cosmetics, C.A.</strong> asegura una experiencia única y eficiente para sus clientes. Además, fortalece la imagen digital de la marca, posicionándola como una empresa innovadora y orientada al cliente.</p><p></p>",
            "estatus": "En producción",
            "tipo_proyecto": "Laboral",
            "tecnologias": [
                "HTML",
                "CSS",
                "Bootstrap",
                "JavaScript",
                "Datatables",
                "JSON",
                "PHP",
                "MySQL"
            ]
        },
        {
            "id": 8,
            "mostrar": true,
            "demo": true,
            "nombre": "Web Olympia Empresas Unidas, C.A.",
            "url": "https://olympiaeu.com/inicio.php",
            "thumb": "../projects/olympia_web/thumbnail.jpg",
            "capturas": 5,
            "descripcion": "<p>Portal informativo desarrollado para <strong>Olympia Empresas Unidas C.A.</strong>, diseñado con el propósito de actualizar y fortalecer su presencia en línea.</p><p>Con un enfoque en la personalización y la funcionalidad, el sistema cuenta con un gestor de contenido que permite adaptar y modificar casi todos los aspectos del portal, brindando una solución flexible y perfectamente ajustada a las necesidades de la empresa.</p><p class='resaltar'>Beneficios del Portal</p><ul><li><strong>Presencia renovada:</strong> Mejora significativa de la imagen corporativa de la empresa en la web.</li><li><strong>Gestión y flexibilidad:</strong> CMS personalizado para editar y actualizar contenido de manera sencilla.</li><li><strong>Conversión efectiva:</strong> Una plataforma diseñada para conectar eficazmente con clientes y colaboradores.</li></ul>",
            "estatus": "En producción",
            "tipo_proyecto": "Freelance",
            "tecnologias": [
                "HTML",
                "CSS",
                "Bootstrap",
                "JavaScript",
                "JSON",
                "PHP",
                "MySQL"
            ]
        },
        {
            "id": 9,
            "mostrar": true,
            "demo": true,
            "nombre": "Ecommerce Casa Mía Bodegon, C.A.",
            "url": "http://enlacesbosto.dnsalias.com:8083/railerch/casamia",
            "thumb": "../projects/casamia_ecommerce/thumbnail.jpg",
            "capturas": 7,
            "descripcion": "<p>Ecommerce desarrollado para el bodegón <strong>Casa Mía</strong> en 2021, diseñado para ofrecer a sus clientes una experiencia de compra rápida, segura y desde la comodidad de sus hogares. Este portal permitió a los usuarios realizar sus compras de manera eficiente y posteriormente retirar los productos en la tienda física.</p><p>Aunque el portal dejó de estar activo por motivos administrativos, transformo la forma en que los clientes interactuaban con los servicios de Casa Mia, destacándose por su funcionalidad y facilidad de uso.</p><p class='resaltar'>Funciones Principales</p><ul><li>Blog informativo</li><li>Registro de usuarios</li><li>Carrito de compra</li><li>Seguimiento de compras realizadas</li><li>CMS para la gestión eficaz de productos, servicios y publicaciones</li></ul>",
            "estatus": "Offline",
            "tipo_proyecto": "Laboral",
            "tecnologias": [
                "HTML",
                "CSS",
                "Bootstrap",
                "JavaScript",
                "jQuery",
                "PHP",
                "MySQL"
            ]
        },
        {
            "id": 10,
            "mostrar": true,
            "demo": false,
            "nombre": "Sistema consulta CNE",
            "url": "../projects/consulta_cne/index.html",
            "thumb": "../projects/consulta_cne/thumbnail.jpg",
            "capturas": 1,
            "descripcion": "<p>Herramienta diseñada para optimizar la consulta de datos de usuarios en el sistema del <strong>CNE</strong>, proporcionando un método eficiente para búsquedas individuales o masivas.</p><p>Esta herramienta es una solución práctica y eficaz para quienes necesitan realizar búsquedas recurrentes de datos en el sistema del CNE ya que simplifica de manera significativa los procesos de búsqueda asegurando precisión y ahorro de tiempo al permitir la iteración automática de un archivo de texto previamente cargado con la información de los usuarios a consultar.</p><p class='resaltar'>Beneficios</p><ul><li><strong>Consulta individual:</strong> Obtén información de un usuario de forma rápida y directa.</li><li><strong>Búsqueda masiva:</strong> Procesa múltiples usuarios de manera simultánea mediante un archivo de texto. </li><li><strong>Automatización:</strong> Reduce tiempos y errores en las consultas repetitivas.</li></ul>",
            "estatus": "En produccion",
            "tipo_proyecto": "Laboral",
            "tecnologias": [
                "HTML",
                "CSS",
                "Bootstrap",
                "JavaScript",
                "Datatables",
                "JSON",
                "PHP"
            ]
        },
        {
            "id": 11,
            "mostrar": true,
            "demo": false,
            "nombre": "Sistema de tokens",
            "url": "../projects/sistema_tokens/index.html",
            "thumb": "../projects/sistema_tokens/thumbnail.jpg",
            "capturas": 3,
            "descripcion": "<p>Sistema web diseñado específicamente para gestionar los usuarios del portal de pedidos de <strong>Intervit C.A.</strong>, ofreciendo una solución práctica y eficiente para la administración de cuentas de manera centralizada y accesible.</p><p>Esta herramienta permite realizar tareas de gestión como la creación, edición y eliminación de usuarios de forma sencilla y rápida, optimizando los procesos administrativos y mejorando la integración con el portal de pedidos de la empresa.</p><p class='resaltar'>Funciones principales</p><ul><li><strong>Gestión de usuarios:</strong> Posibilidad de crear, editar y eliminar cuentas.</li><li><strong>Asignación de sucursales y almacenes:</strong> Los usuarios pueden ser vinculados directamente a ubicaciones específicas.</li><li><strong>Uso de tokens:</strong> Opcionalmente, se pueden asignar tokens a los usuarios, brindándoles permisos adicionales para modificar parámetros en el portal de pedidos.</li><li><strong>Descentralización del sistema:</strong> Permite una gestión autónoma de usuarios, reduciendo la dependencia directa del sistema Profit.</li><li><strong>Envio de mensajes administrativos:</strong> Permite enviar mensajes de forma masiva a los usuarios facilitando asi el aviso de eventos especiales con la herramienta.</li></ul>",
            "estatus": "En producción",
            "tipo_proyecto": "Laboral",
            "tecnologias": [
                "HTML",
                "CSS",
                "Bootstrap",
                "JavaScript",
                "Datatables",
                "JSON",
                "PHP",
                "MySQL"
            ]
        },
        {
            "id": 12,
            "mostrar": true,
            "demo": true,
            "nombre": "Demo Interactivo de PWA",
            "url": "../projects/demo_pwa/index.html",
            "thumb": "../projects/demo_pwa/thumbnail.jpg",
            "capturas": 0,
            "descripcion": "<p>Este proyecto demuestra el potencial y la practicidad de una <strong>Progressive Web App (PWA)</strong>, combinando características modernas para ofrecer una experiencia eficiente e interactiva tanto en línea como fuera de ella.</p><p class='resaltar'>Características principales</p><ul><li><strong>Instalable:</strong> Los usuarios pueden agregarlo fácilmente a sus dispositivos como si fuese una aplicación nativa.</li><li><strong>Consumo de API REST:</strong> Integra servicios externos para obtener y mostrar datos dinámicos en tiempo real.</li><li><strong>Gestión de caché:</strong> Optimiza el uso de recursos al almacenar contenido localmente para accesos futuros más rápidos.</li><li><strong>Actividad offline:</strong> Permite a los usuarios interactuar con la aplicación incluso en ausencia de conexión a internet.</li></ul>",
            "estatus": "Demo interacivo",
            "tipo_proyecto": "Portafolio",
            "tecnologias": [
                "HTML",
                "CSS",
                "Bootstrap",
                "JavaScript",
                "JSON",
                "Service Worker API"
            ]
        },
        {
            "id": 13,
            "mostrar": true,
            "demo": true,
            "nombre": "UI APP movil",
            "url": "../projects/mobile_ui/index.html",
            "thumb": "../projects/mobile_ui/thumbnail.jpg",
            "capturas": 0,
            "descripcion": "<p>Este proyecto fue diseñado para brindar a los clientes de <strong>JBPassport</strong>una plataforma innovadora y funcional que facilitara el acceso a servicios clave de la empresa asi como tambien una herramienta avanzada de gestión del lado administrativo.</p><p class='resaltar'>Características principales</p><ul><li><strong>Realización de pagos:</strong> Interfaz sencilla y segura que permite a los clientes efectuar transacciones rápidamente.</li><li><strong>Solicitud de combustible:</strong> Función dedicada para gestionar solicitudes de manera eficiente.</li><li><strong>Información de interés:</strong> Acceso a datos relevantes y actualizaciones importantes directamente desde la plataforma.</li><li><strong>Portal de gestión de clientes:</strong> Herramienta especializada para ejecutivos de venta, diseñada para administrar perfiles y optimizar procesos comerciales.</li></ul><br><p><span class='resaltar'>Datos de prueba:</span> Usuario: 'admin' ó 'client' | Clave: 1234</p>",
            "estatus": "Demo",
            "tipo_proyecto": "Freelance",
            "tecnologias": [
                "HTML",
                "CSS",
                "Bootstrap",
                "JavaScript",
                "Datatables",
                "JSON"
            ]
        },
        {
            "id": 14,
            "mostrar": true,
            "demo": true,
            "nombre": "Generador QR",
            "url": "../projects/generador_qr/index.html",
            "thumb": "../projects/generador_qr/thumbnail.jpg",
            "capturas": 0,
            "descripcion": "Generador de codigo QR de uso personal 100% funcional.",
            "estatus": "Activo",
            "tipo_proyecto": "Portafolio",
            "tecnologias": [
                "HTML",
                "SCSS",
                "Bootstrap",
                "JavaScript"
            ]
        },
        {
            "id": 15,
            "mostrar": true,
            "demo": true,
            "nombre": "Carrito de compra",
            "url": "../projects/carrito_compra/index.html",
            "thumb": "../projects/carrito_compra/thumbnail.jpg",
            "capturas": 0,
            "descripcion": "Proyecto vanilla Javascript, consiste en la simulación de un carrito de compras en integracion con la plataforma de pagos STRIPE en el cual puedes seleccionar articulos con un stock limitado, estos se pueden agregar o eliminar de la compra disminuyendo o aumentando el stock respectivamente, se puede ajustar el porcentaje de descuento al inicio de la compra, realiza los calculos subtotal, descuento y total.",
            "estatus": "Demo activo",
            "tipo_proyecto": "Portafolio",
            "tecnologias": [
                "HTML",
                "CSS",
                "Bootstrap",
                "JavaScript",
                "JSON",
                "Stripe"
            ]
        },
        {
            "id": 16,
            "mostrar": true,
            "demo": true,
            "nombre": "Demo tablero Kanban",
            "url": "../projects/drag_drop/index.html",
            "thumb": "../projects/drag_drop/thumbnail.jpg",
            "capturas": 0,
            "descripcion": "La finalidad de este demo es mostrar una version minimalista de un panel de tareas estilo Kanban mediante el uso de la interfaz Drag & Drop de Javascript",
            "estatus": "Demo interactivo",
            "tipo_proyecto": "Práctica",
            "tecnologias": [
                "HTML",
                "CSS",
                "JavaScript"
            ]
        },
        {
            "id": 17,
            "mostrar": true,
            "demo": true,
            "nombre": "Proyecto de Interacción con IndexedDB",
            "url": "../projects/crud_indexeddb/index.html",
            "thumb": "../projects/crud_indexeddb/thumbnail.jpg",
            "capturas": 0,
            "descripcion": "<p>Este proyecto de prueba fue desarrollado con el propósito de explorar las capacidades de la <strong>IndexedDB API</strong>, una base de datos integrada en el navegador que permite gestionar información de forma dinámica y eficiente.</p><p>La aplicación cuenta con un asistente interactivo que guía al usuario en la creación de la base de datos y una tabla de registros. Al finalizar, se genera automáticamente un formulario basado en los campos definidos en la tabla, facilitando la inserción, visualización, modificación y eliminación de registros.</p><p class='resaltar'>Características principales</p><ul><li><strong>Asistente dinámico:</strong> Crea la base de datos y valida que no exista previamente, conectándose a bases de datos existentes si es necesario.</li><li><strong>Gestión de registros:</strong> Permite visualizar, modificar y eliminar registros de forma sencilla y rápida.</li><li><strong>Formulario dinámico:</strong> Generación automática del formulario según los campos definidos en la tabla.</li><li><strong>Interacción integral:</strong> Funcionalidad adaptada para optimizar la gestión de datos directamente en el navegador.</li></ul>",
            "estatus": "Demo activo",
            "tipo_proyecto": "Práctica",
            "tecnologias": [
                "HTML",
                "CSS",
                "Bootstrap",
                "JavaScript",
                "JSON",
                "IndexedDB API"
            ]
        },
        {
            "id": 18,
            "mostrar": true,
            "demo": true,
            "nombre": "View-timeline CSS",
            "url": "../projects/view_timeLine_css/index.html",
            "thumb": "../projects/view_timeLine_css/thumbnail.jpg",
            "capturas": 0,
            "descripcion": "Proyecto realizado para testear animación de imágenes basada en desplazamiento mediante la propiedad 'view-timeline' de CSS.",
            "estatus": "Demo activo",
            "tipo_proyecto": "Portafolio",
            "tecnologias": [
                "HTML",
                "CSS",
                "Bootstrap",
                "JavaScript"
            ]
        },
        {
            "id": 19,
            "mostrar": true,
            "demo": true,
            "nombre": "Binance API",
            "url": "../projects/crypto_app/index.html",
            "thumb": "../projects/crypto_app/thumbnail.jpg",
            "capturas": 0,
            "descripcion": "<p>Prueba de integracion sencilla con la <strong>Binance APIs</strong> para la consulta de criptomonedas globales y sus valores actuales.</p>",
            "estatus": "Demo activo",
            "tipo_proyecto": "Portafolio",
            "tecnologias": [
                "HTML",
                "SASS",
                "Typescript"
            ]
        },
        {
            "id": 20,
            "mostrar": true,
            "demo": true,
            "nombre": "Landing page SASS",
            "url": "../projects/landing_page_sass/index.html",
            "thumb": "../projects/landing_page_sass/thumbnail.jpg",
            "capturas": 0,
            "descripcion": "Landing page minimalista maquetada con SASS.",
            "estatus": "Demo activo",
            "tipo_proyecto": "Portafolio",
            "tecnologias": [
                "HTML",
                "SASS",
                "Typescript"
            ]
        }
    ],
    "logoSlider": [
        {
            "nombre": "HTML",
            "imagen": "public/img/logos-slider/html.png"
        },
        {
            "nombre": "CSS",
            "imagen": "public/img/logos-slider/css.png"
        },
        {
            "nombre": "JavaScript",
            "imagen": "public/img/logos-slider/javascript.png"
        },
        {
            "nombre": "TypeScript",
            "imagen": "public/img/logos-slider/typescript.png"
        },
        {
            "nombre": "React",
            "imagen": "public/img/logos-slider/react.png"
        },
        {
            "nombre": "Bootstrap",
            "imagen": "public/img/logos-slider/bootstrap.png"
        },
        {
            "nombre": "Node",
            "imagen": "public/img/logos-slider/node.png"
        },
        {
            "nombre": "PHP",
            "imagen": "public/img/logos-slider/php.png"
        },
        {
            "nombre": "Laravel",
            "imagen": "public/img/logos-slider/laravel.png"
        },
        {
            "nombre": "GitHub",
            "imagen": "public/img/logos-slider/github.png"
        }
    ],
    "redesSociales": [
        {
            "nombre": "LinkedIn",
            "icono": "bi bi-linkedin",
            "link": "https://www.linkedin.com/in/railerch"
        },
        {
            "nombre": "GitHub",
            "icono": "bi bi-git",
            "link": "https://github.com/railerch"
        },
        {
            "nombre": "Whatsapp",
            "icono": "bi bi-whatsapp",
            "whatsapp_mensaje": "Hola, te escribo desde tu web para obtener mas información acerca de tus servicios, gracias!"
        }
    ],
    "tienda": {
        "servicios": [
            {
                "estaActivo": true,
                "nombre": "Desarrollo Web JavaScript",
                "imagen": "public/img/services/web-development.jpg",
                "contenido": [
                    "Diseño, planificación e implementación",
                    "Tiempo minimo 7 días",
                    "Reportes de avance",
                    "Código fuente al finalizar",
                    "1 semana de soporte gratuito"
                ],
                "costo_hora": 20.00,
                "whatsapp_mensaje": "Hola, me gustaría recibir información sobre el servicio de 'Desarrollo Web JavaScript', gracias!"
            },
            {
                "estaActivo": false,
                "nombre": "Desarrollo web Wordpress",
                "imagen": "public/img/services/wordpress-development.jpg",
                "contenido": [
                    "Diseño e implementacion",
                    "Ecommerce",
                    "Catalogos en linea",
                    "Temas personalizados",
                    "Desarrollo de Plugins"
                ],
                "costo_hora": 15.00,
                "whatsapp_mensaje": "Hola, me gustaría recibir información sobre el servicio de 'Desarrollo web Wordpress', gracias!"
            },
            {
                "estaActivo": false,
                "nombre": "Asesoría para PYMEs",
                "imagen": "public/img/services/audit-consulting.jpg",
                "contenido": [
                    "Diseño y planificación",
                    "Estructura del proyecto",
                    "Código fuente",
                    "Buenas practicas",
                    "Implementación"
                ],
                "costo_hora": 10.00,
                "whatsapp_mensaje": "Hola, me gustaría recibir información sobre el servicio de 'Asesoría y Consultoría', gracias!"
            }
        ],
        "aplicaciones": [
            {
                "nombre": "Ticket System",
                "descripcion": "",
                "tecnologias": [],
                "beneficios": [],
                "precio": 600.00
            },
            {
                "descripcion": "Sistema de reservas Online",
                "beneficios": [],
                "tecnologias": [],
                "precio": 450.00
            },
            {
                "descripcion": "Landing Page personalizable",
                "beneficios": [],
                "tecnologias": [],
                "precio": 400.00
            }
        ]
    }
}